govi_chart/app/controllers/home_controller.rb

SELECT * FROM `widgets`
SELECT * FROM `widget_stats` WHERE (`widget_stats`.widget_id = 1)
---
  def area_chart
    @data = Widget.all
    @series = @data.map{|w| w.widget_stats}

SELECT * FROM `widgets`
---
  def bar_chart
    @widgets = Widget.all

SELECT * FROM `widgets`
---
  def column_chart
    @widgets = Widget.all

SELECT * FROM `widgets`
---
  def gauge
    @data = Widget.all

SELECT * FROM `locations`
---
  def geo_chart
    @locations = Location.all

SELECT * FROM `widgets`
SELECT * FROM `widget_stats` WHERE (`widget_stats`.widget_id = 1)
---
  def line_chart
    @data = Widget.all
    @series = @data.map{|w| w.widget_stats}

SELECT * FROM `widgets`
---
  def pie_chart
    @data = Widget.all